Imported down all the necessary libraries which is thankfully just Pandas

In [1]:
import pandas as pd

Read the dataset using Pandas read_csv feature

In [2]:
dataset=pd.read_csv('bbb_odi_data.csv')

C:\Users\Vijay\AppData\Local\Temp\ipykernel_8580\2538919985.py:1: DtypeWarning: Columns (41,52,53) have mixed types. Specify dtype option on import or set low_memory=False.
  dataset=pd.read_csv('bbb_odi_data.csv')

Filtered out the dataset to get the instances only where the Current run rate was <=5 during the course of the game

In [3]:
resultdf=dataset[dataset['inns_rr']>8]

There are several columns and I chose only the ones meaningful to the related query by using a list.

In [4]:
req_cols=['bat','batruns','ballfaced']

Now, my dataset is filtered out to get only the required columns

In [5]:
result=resultdf[req_cols]

Grouped sum of the required columns gives us the overall aggregate of the data. I've reset the columns as well to include the names as a row value in the dataset.

In [6]:
grouped=result.groupby(['bat']).sum().reset_index()

In [7]:
grouped

                 bat  batruns  ballfaced
0     AB de Villiers      278        136
1       Aarif Sheikh        4          1
2        Aaron Finch      385        220
3       Aaron Hardie        2          5
4      Aaron Johnson       39         16
..               ...      ...        ...
534       Zane Green        1          1
535  Zeeshan Maqsood        4         13
536     Ziaur Rahman       12          9
537    Zubin Surkari        5          7
538  Zunaed Siddique       96         57

[539 rows x 3 columns]

I've used this different approach to sum the dismissals because there are some run out dismissals and not always it has been the striker who has gotten out, so based on the who_out? column values summation, I've found out the number of dismissals in this specific filter.

In [8]:
dis=pd.DataFrame(resultdf['who_out?'].value_counts()).reset_index()

This is an attempt to make a similar column in both the dataframes, and use it for joins later.

In [9]:
dis.rename({'index':'bat'},axis=1,inplace=True)

In [10]:
dis

                      bat  who_out?
0         Virender Sehwag        19
1        Brendon McCullum        14
2          Jonny Bairstow        12
3               Jason Roy        11
4    Tillakaratne Dilshan        11
..                    ...       ...
238              Ian Bell         1
239       Stephan Myburgh         1
240        Mirwais Ashraf         1
241         Gulbadin Naib         1
242              Anil Sah         1

[243 rows x 2 columns]

A left join has been performed on the left dataset which is the grouped data and then they've been joined on 'bat' column

In [11]:
finalresult=pd.merge(grouped,dis,how='left',on='bat')

Now, they've been sorted by descending order of 'batruns' and this operation has been performed in place to reflect the changes

In [12]:
finalresult.sort_values(by='batruns',ascending=False,inplace=True)

The resultant column names have been renamed for easier interpretation

In [13]:
finalresult.rename({'who_out?':'dismissals','batruns':'runs','ballfaced':'balls'},axis=1,inplace=True)

In [14]:
finalresult

                      bat  runs  balls  dismissals
495  Tillakaratne Dilshan  1026    674        11.0
515       Virender Sehwag   972    571        19.0
81       Brendon McCullum   834    355        14.0
298        Martin Guptill   783    476         8.0
123          David Warner   700    428         8.0
..                    ...   ...    ...         ...
270      Laxman Sreekumar     0      1         NaN
256          Kinchit Shah     0      1         NaN
493    Thilan Samaraweera     0      1         1.0
243        Justin Greaves     0      2         NaN
83             Brian Lara     0      1         NaN

[539 rows x 4 columns]

Before performing mathematical operations to find out the averages and strike rates, I've actually verified if the data types are suitable for calculations or not. Since both are of the same 'integer' type, it is easier for me to perform the operations.

In [15]:
finalresult.dtypes

bat            object
runs            int64
balls           int64
dismissals    float64
dtype: object

The averages and Runs Per Over (rpo) were calculated from the existing data and were rounded off to the 2 nearest decimal places.

In [16]:
finalresult['avg']=(finalresult['runs']/finalresult['dismissals'])
finalresult['avg']=round(finalresult['avg'],2)

In [17]:
finalresult['rpo']=(finalresult['runs']*6/finalresult['balls'])
finalresult['rpo']=round(finalresult['rpo'],2)

The end result has been saved to a csv file to use them further for visualizations on tableau

In [18]:
finalresult.to_csv('above8.csv')

In [19]:
finalresult

                      bat  runs  balls  dismissals    avg    rpo
495  Tillakaratne Dilshan  1026    674        11.0  93.27   9.13
515       Virender Sehwag   972    571        19.0  51.16  10.21
81       Brendon McCullum   834    355        14.0  59.57  14.10
298        Martin Guptill   783    476         8.0  97.88   9.87
123          David Warner   700    428         8.0  87.50   9.81
..                    ...   ...    ...         ...    ...    ...
270      Laxman Sreekumar     0      1         NaN    NaN   0.00
256          Kinchit Shah     0      1         NaN    NaN   0.00
493    Thilan Samaraweera     0      1         1.0   0.00   0.00
243        Justin Greaves     0      2         NaN    NaN   0.00
83             Brian Lara     0      1         NaN    NaN   0.00

[539 rows x 6 columns]